f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/deprecated/ucs.c
    for ( i = 0; i < CLKSourceDivider; i++){
        CLKSourceFrequencyDivider *= 2;
    }

    switch (CLKSource){
        case SELM__XT1CLK:
            CLKFrequency = (UCS_XT1ClockFrequency /
                            CLKSourceFrequencyDivider);

            if(XTS != (HWREG16(baseAddress + OFS_UCSCTL6) & XTS))  {
              if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG){
                    CLKFrequency = UCS_REFOCLK_FREQUENCY;
                }
              }
            }
            else {
              if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1HFOFFG){
                HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_UCSCTL7) & XT1HFOFFG){
                    CLKFrequency = UCS_REFOCLK_FREQUENCY;
                }
              }
            }
            break;

        case SELM__VLOCLK:
            CLKFrequency =
                (UCS_VLOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;
        case SELM__REFOCLK:
            CLKFrequency =
                (UCS_REFOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;
        case SELM__XT2CLK:
            CLKFrequency =
                (UCS_XT2ClockFrequency / CLKSourceFrequencyDivider);

            if (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){

              HWREG8(baseAddress + OFS_UCSCTL7) &=  ~XT2OFFG;
              //Clear OFIFG fault flag
              HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
            }

            if (HWREG8(baseAddress + OFS_UCSCTL7) & XT2OFFG){
                CLKFrequency =
                    privateUCSSourceClockFromDCO(baseAddress, SELM__DCOCLKDIV);
            }
            break;
        case SELM__DCOCLK:
        case SELM__DCOCLKDIV:
            CLKFrequency = privateUCSSourceClockFromDCO(baseAddress,
                CLKSource) / CLKSourceFrequencyDivider;
            break;
    }

    return ( CLKFrequency) ;
}

void UCS_setExternalClockSource (uint16_t baseAddress,
    uint32_t XT1CLK_frequency,
    uint32_t XT2CLK_frequency
    )
{
    UCS_XT1ClockFrequency = XT1CLK_frequency;
    UCS_XT2ClockFrequency = XT2CLK_frequency;
}

void UCS_clockSignalInit ( uint16_t baseAddress,
    uint8_t selectedClockSignal,
    uint16_t clockSource,
    uint16_t clockSourceDivider
    )
{
    assert(
        (UCS_XT1CLK_SELECT == clockSource) ||
        (UCS_VLOCLK_SELECT == clockSource) ||
        (UCS_REFOCLK_SELECT == clockSource) ||
        (UCS_DCOCLK_SELECT == clockSource) ||
        (UCS_DCOCLKDIV_SELECT == clockSource) ||
        (UCS_XT2CLK_SELECT == clockSource)
        );

    assert(
        (UCS_CLOCK_DIVIDER_1 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_2 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_4 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_8 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_16 == clockSourceDivider) ||
        (UCS_CLOCK_DIVIDER_32 == clockSourceDivider)
        );

    switch (selectedClockSignal){
        case UCS_ACLK:
            HWREG16(baseAddress + OFS_UCSCTL4) &= ~(SELA_7);
            clockSource = clockSource << 8;
            HWREG16(baseAddress + OFS_UCSCTL4) |= (clockSource);

            HWREG16(baseAddress + OFS_UCSCTL5) &= ~(DIVA_7);
            clockSourceDivider = clockSourceDivider << 8;
            HWREG16(baseAddress + OFS_UCSCTL5) |= clockSourceDivider;
            break;
        case UCS_SMCLK:
            HWREG16(baseAddress + OFS_UCSCTL4) &= ~(SELS_7);
            clockSource = clockSource << 4;
            HWREG16(baseAddress + OFS_UCSCTL4) |= (clockSource);

            HWREG16(baseAddress + OFS_UCSCTL5) &= ~(DIVS_7);
            clockSourceDivider = clockSourceDivider << 4;
            HWREG16(baseAddress + OFS_UCSCTL5) |= clockSourceDivider;
            break;
        case UCS_MCLK:
            HWREG16(baseAddress + OFS_UCSCTL4) &= ~(SELM_7);
            HWREG16(baseAddress + OFS_UCSCTL4) |= (clockSource);

            HWREG16(baseAddress + OFS_UCSCTL5) &= ~(DIVM_7);
            HWREG16(baseAddress + OFS_UCSCTL5) |= clockSourceDivider;
            break;
        case UCS_FLLREF:
            assert(clockSource <= SELA_5);
            HWREG8(baseAddress + OFS_UCSCTL3) &=  ~(SELREF_7);

            clockSource = clockSource << 4;
            HWREG8(baseAddress + OFS_UCSCTL3) |= (clockSource);

            HWREG8(baseAddress + OFS_UCSCTL3) &= ~(FLLREFDIV_7);
            //Note that dividers for FLLREF are slightly different
            //Hence handled differently from other CLK signals
            switch(clockSourceDivider)
            {
              case UCS_CLOCK_DIVIDER_12:
                HWREG8(baseAddress + OFS_UCSCTL3) |= FLLREFDIV__12;
                break;
              case UCS_CLOCK_DIVIDER_16:
                HWREG8(baseAddress + OFS_UCSCTL3) |= FLLREFDIV__16;
                break;
              default:
                HWREG8(baseAddress + OFS_UCSCTL3) |= clockSourceDivider;
                break;
            }

            break;
    }
}

void UCS_LFXT1Start (uint16_t baseAddress,
    uint16_t xt1drive,
    uint8_t xcap
    )
{
    assert((xcap == UCS_XCAP_0) ||
        (xcap == UCS_XCAP_1) ||
        (xcap == UCS_XCAP_2) ||
        (xcap == UCS_XCAP_3) );

    assert((xt1drive == UCS_XT1_DRIVE0 ) ||
        (xt1drive == UCS_XT1_DRIVE1 ) ||
        (xt1drive == UCS_XT1_DRIVE2 ) ||
        (xt1drive == UCS_XT1_DRIVE3 ));

    //If the drive setting is not already set to maximum
    //Set it to max for LFXT startup
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != XT1DRIVE_3){
        //Highest drive setting for XT1startup
        HWREG16(baseAddress + OFS_UCSCTL6_L) |= XT1DRIVE1_L + XT1DRIVE0_L;
    }

    //Enable LF mode and clear xcap and bypass
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~(XTS + XCAP_3 + XT1BYPASS);
    HWREG16(baseAddress + OFS_UCSCTL6) |= xcap;

    while (HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG)
    {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //set requested Drive mode
    HWREG16(baseAddress + OFS_UCSCTL6) = ( HWREG16(baseAddress + OFS_UCSCTL6) &
                                         ~(XT1DRIVE_3)
                                         ) |
                                       (xt1drive);

    //Switch ON XT1 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;
}

void UCS_HFXT1Start(uint16_t baseAddress,
    uint16_t xt1drive
    )
{
    //Check if drive value is the expected one
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != xt1drive){
        //Clear XT1drive field
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1DRIVE_3;

