f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/deprecated/ucs.c
        //Set requested value
        HWREG16(baseAddress + OFS_UCSCTL6) |= xt1drive;
    }

    //Enable HF mode
    HWREG16(baseAddress + OFS_UCSCTL6) |= XTS;

    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1BYPASS;

    // Check XT1 fault flags
    while((HWREG8(baseAddress + OFS_UCSCTL7) & (XT1HFOFFG))){
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //Switch ON XT1 oscillator
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;
}

void UCS_bypassXT1 ( uint16_t baseAddress,
    uint8_t highOrLowFrequency
    )
{
    assert((UCS_XT1_LOW_FREQUENCY == highOrLowFrequency) ||
        (UCS_XT1_HIGH_FREQUENCY == highOrLowFrequency )
        );

    //Enable HF/LF mode
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XTS;
    HWREG16(baseAddress + OFS_UCSCTL6) |= highOrLowFrequency;

    //Switch OFF XT1 oscillator and enable BYPASS mode
    HWREG16(baseAddress + OFS_UCSCTL6) |= (XT1BYPASS + XT1OFF);

    if (UCS_XT1_LOW_FREQUENCY == highOrLowFrequency){
      while (HWREG8(baseAddress + OFS_UCSCTL7) & (XT1LFOFFG)) {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);

        // Clear the global fault flag. In case the XT1 caused the global fault
        // flag to get set this will clear the global error condition. If any
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      }
    } else   {
        while (HWREG8(baseAddress + OFS_UCSCTL7) & (XT1HFOFFG)) {
          //Clear OSC flaut Flags fault flags
          HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);

          //Clear the global fault flag. In case the XT1 caused the global fault
          //flag to get set this will clear the global error condition. If any
          //error condition persists, global flag will get again.
          HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
        }
      }

}

bool UCS_LFXT1StartWithTimeout(uint16_t baseAddress,
    uint16_t xt1drive,
    uint8_t xcap,
    uint16_t timeout
    )
{
    assert((xcap == UCS_XCAP_0) ||
        (xcap == UCS_XCAP_1) ||
        (xcap == UCS_XCAP_2) ||
        (xcap == UCS_XCAP_3) );

    assert((xt1drive == UCS_XT1_DRIVE0 ) ||
        (xt1drive == UCS_XT1_DRIVE1 ) ||
        (xt1drive == UCS_XT1_DRIVE2 ) ||
        (xt1drive == UCS_XT1_DRIVE3 ));

    assert(timeout > 0);

    //If the drive setting is not already set to maximum
    //Set it to max for LFXT startup
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != XT1DRIVE_3){
        //Highest drive setting for XT1startup
        HWREG16(baseAddress + OFS_UCSCTL6_L) |= XT1DRIVE1_L + XT1DRIVE0_L;
    }

   	//Enable LF mode and clear xcap and bypass
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~(XTS + XCAP_3 + XT1BYPASS);
    HWREG16(baseAddress + OFS_UCSCTL6) |= xcap;

    do
    {
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }while ((HWREG8(baseAddress + OFS_UCSCTL7) & XT1LFOFFG) && --timeout);

    if (timeout){
        //set requested Drive mode
        HWREG16(baseAddress + OFS_UCSCTL6) = ( HWREG16(baseAddress + OFS_UCSCTL6) &
                                             ~(XT1DRIVE_3)
                                             ) |
                                           (xt1drive);
        //Switch ON XT1 oscillator
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;

        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

bool UCS_HFXT1StartWithTimeout (  uint16_t baseAddress,
    uint16_t xt1drive,
    uint16_t timeout
    )
{
    assert((xt1drive == UCS_XT1_DRIVE0 ) ||
        (xt1drive == UCS_XT1_DRIVE1 ) ||
        (xt1drive == UCS_XT1_DRIVE2 ) ||
        (xt1drive == UCS_XT1_DRIVE3 ));

    assert(timeout > 0);

    //Check if drive value is the expected one
    if ((HWREG16(baseAddress + OFS_UCSCTL6) & XT1DRIVE_3) != xt1drive){
        //Clear XT1drive field
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1DRIVE_3;

        //Set requested value
        HWREG16(baseAddress + OFS_UCSCTL6) |= xt1drive;
    }

    //Enable HF mode
    HWREG16(baseAddress + OFS_UCSCTL6) |= XTS;

    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1BYPASS;

    // Check XT1 fault flags
    do
    {
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }while ((HWREG8(baseAddress + OFS_UCSCTL7) & ( XT1HFOFFG))
            && --timeout);

    if (timeout){
        //Switch ON XT1 oscillator
        HWREG16(baseAddress + OFS_UCSCTL6) &= ~XT1OFF;

        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

bool UCS_bypassXT1WithTimeout (uint16_t baseAddress,
    uint8_t highOrLowFrequency,
    uint16_t timeout
    )
{
    assert((UCS_XT1_LOW_FREQUENCY == highOrLowFrequency) ||
        (UCS_XT1_HIGH_FREQUENCY == highOrLowFrequency )
        );

    assert(timeout > 0);

    //Enable HF/LF mode
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~XTS;
    HWREG16(baseAddress + OFS_UCSCTL6) |= highOrLowFrequency;

    //Switch OFF XT1 oscillator  and enable bypass
    HWREG16(baseAddress + OFS_UCSCTL6) |= (XT1BYPASS + XT1OFF);

    if (UCS_XT1_LOW_FREQUENCY == highOrLowFrequency){
      do {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1LFOFFG);

        // Clear the global fault flag. In case the XT1 caused the global fault
        // flag to get set this will clear the global error condition. If any
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      }while ((HWREG8(baseAddress + OFS_UCSCTL7) & (XT1LFOFFG)) && --timeout);

    } else   {
        do {
          //Clear OSC flaut Flags fault flags
          HWREG8(baseAddress + OFS_UCSCTL7) &= ~(XT1HFOFFG);

