f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/deprecated/ucs.c
void UCS_initFLLSettle ( uint16_t baseAddress,
    uint16_t fsystem,
    uint16_t ratio
    )
{
    volatile uint16_t x = ratio * 32;

    UCS_initFLL(baseAddress, fsystem, ratio);

    while (x--)
    {
        __delay_cycles(30);
    }
}

void UCS_initFLL ( uint16_t baseAddress,
    uint16_t fsystem,
    uint16_t ratio
    )
{
    uint16_t d, dco_div_bits;
    uint16_t mode = 0;

    //Save actual state of FLL loop control, then disable it. This is needed to
    //prevent the FLL from acting as we are making fundamental modifications to
    //the clock setup.
    uint16_t srRegisterState = __get_SR_register() & SCG0;

    d = ratio;
    //Have at least a divider of 2
    dco_div_bits = FLLD__2;

    if (fsystem > 16000){
        d >>= 1 ;
        mode = 1;
    } else   {
        //fsystem = fsystem * 2
        fsystem <<= 1;
    }

    while (d > 512)
    {
        //Set next higher div level
        dco_div_bits = dco_div_bits + FLLD0;
        d >>= 1;
    }

    // Disable FLL
    __bis_SR_register(SCG0);

    //Set DCO to lowest Tap
    HWREG8(baseAddress + OFS_UCSCTL0_H) = 0x0000;

    //Reset FN bits
    HWREG16(baseAddress + OFS_UCSCTL2) &= ~(0x03FF);
    HWREG16(baseAddress + OFS_UCSCTL2) = dco_div_bits | (d - 1);

    if (fsystem <= 630){           //fsystem < 0.63MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_0;
    } else if (fsystem <  1250){      //0.63MHz < fsystem < 1.25MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_1;
    } else if (fsystem <  2500){      //1.25MHz < fsystem <  2.5MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_2;
    } else if (fsystem <  5000){      //2.5MHz  < fsystem <    5MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_3;
    } else if (fsystem <  10000){     //5MHz    < fsystem <   10MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_4;
    } else if (fsystem <  20000){     //10MHz   < fsystem <   20MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_5;
    } else if (fsystem <  40000){     //20MHz   < fsystem <   40MHz
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_6;
    } else {
        HWREG8(baseAddress + OFS_UCSCTL1) = DCORSEL_7;
    }

    // Re-enable FLL
     __bic_SR_register(SCG0);

    while (HWREG8(baseAddress + OFS_UCSCTL7_L) & DCOFFG)
    {
        //Clear OSC flaut Flags
        HWREG8(baseAddress + OFS_UCSCTL7_L) &= ~(DCOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Restore previous SCG0
    __bis_SR_register(srRegisterState);

    if (mode == 1){
        //fsystem > 16000
        //Select DCOCLK
        HWREG16(baseAddress + OFS_UCSCTL4) &=  ~(SELM_7 + SELS_7);
        HWREG16(baseAddress + OFS_UCSCTL4) |= SELM__DCOCLK + SELS__DCOCLK;
    } else   {
        //Select DCODIVCLK
        HWREG16(baseAddress + OFS_UCSCTL4) &=  ~(SELM_7 + SELS_7);
        HWREG16(baseAddress + OFS_UCSCTL4) |= SELM__DCOCLKDIV + SELS__DCOCLKDIV;
    }

}

void UCS_enableClockRequest (uint16_t baseAddress,
    uint8_t selectClock
    )
{
    HWREG8(baseAddress + OFS_UCSCTL8) |= selectClock;
}

void UCS_disableClockRequest (uint16_t baseAddress,
    uint8_t selectClock
    )
{
    HWREG8(baseAddress + OFS_UCSCTL8) &= ~selectClock;
}

uint8_t UCS_faultFlagStatus (uint16_t baseAddress,
    uint8_t mask
    )
{
    assert(mask <= UCS_XT2OFFG );
    return (HWREG8(baseAddress + OFS_UCSCTL7) & mask);
}

void UCS_clearFaultFlag (uint16_t baseAddress,
    uint8_t mask
    )
{
    assert(mask <= UCS_XT2OFFG );
    HWREG8(baseAddress + OFS_UCSCTL7) &= ~mask;
}

void UCS_SMCLKOff (uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_UCSCTL6) |= SMCLKOFF;
}

void UCS_SMCLKOn (uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_UCSCTL6) &= ~SMCLKOFF;
}

uint32_t UCS_getACLK (uint16_t baseAddress)
{
    //Find ACLK source
    uint16_t ACLKSource = (HWREG16(baseAddress + OFS_UCSCTL4) & SELA_7);

    ACLKSource = ACLKSource >> 8;

    uint16_t ACLKSourceDivider =  HWREG16(baseAddress + OFS_UCSCTL5) & DIVA_7;
    ACLKSourceDivider = ACLKSourceDivider >> 8;

    return (privateUCSComputeCLKFrequency(baseAddress,
                ACLKSource,
                ACLKSourceDivider
                ));
}

uint32_t UCS_getSMCLK (uint16_t baseAddress)
{
    uint16_t SMCLKSource = HWREG8(baseAddress + OFS_UCSCTL4_L) & SELS_7;

    SMCLKSource = SMCLKSource >> 4;

    uint16_t SMCLKSourceDivider =
        HWREG16(baseAddress + OFS_UCSCTL5) & DIVS_7;
    SMCLKSourceDivider = SMCLKSourceDivider >> 4;

    return (privateUCSComputeCLKFrequency(baseAddress,
                SMCLKSource,
                SMCLKSourceDivider )
            );
}

uint32_t UCS_getMCLK (uint16_t baseAddress)
{
    //Find AMCLK source
    uint16_t MCLKSource = (HWREG16(baseAddress + OFS_UCSCTL4) & SELM_7);

    uint16_t MCLKSourceDivider =  HWREG16(baseAddress + OFS_UCSCTL5) & DIVM_7;

    return (privateUCSComputeCLKFrequency(baseAddress,
                MCLKSource,
                MCLKSourceDivider )
            );
}

uint16_t UCS_clearAllOscFlagsWithTimeout(uint16_t baseAddress,
                                             uint16_t timeout
                                             )
{
    assert(timeout > 0);

    do {
      // Clear all osc fault flags
      HWREG8(baseAddress + OFS_UCSCTL7) &= ~(DCOFFG +
                                             XT1LFOFFG +
                                             XT1HFOFFG +
                                             XT2OFFG
                                             );

#if defined (__CC430F5133__) || (__CC430F5135__) || (__CC430F5137__) || \
            (__CC430F6125__) || (__CC430F6126__) || (__CC430F6127__) || \
            (__CC430F6135__) || (__CC430F6137__) || (__CC430F5123__) || \
            (__CC430F5125__) || (__CC430F5143__) || (__CC430F5145__) || \
            (__CC430F5147__) || (__CC430F6143__) || (__CC430F6145__) || \
            (__CC430F6147__)
        // CC430 uses a different fault mechanism. It requires 3 VLO clock
        // cycles delay.If 20MHz CPU, 5000 clock cycles are required in worst
        // case.
        __delay_cycles(5000);
#endif

      // Clear the global osc fault flag.
      HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

      // Check XT1 fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);

    return (HWREG8(baseAddress + OFS_UCSCTL7) & (DCOFFG +
                                                 XT1LFOFFG +
                                                 XT1HFOFFG +
                                                 XT2OFFG)
                                                );
}

#endif
#endif
//*****************************************************************************
//
//! Close the doxygen group for ucs_api
//! @}
//
//*****************************************************************************
//Released_Version_4_20_00
